app/Controllers/BoothController.php

    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            // User is not logged in, redirect to login page
            return redirect()->to('/');
        }

        // Get user data from session
        $data['name'] = session()->get('name');
        $data['username'] = session()->get('username');

        // Load model WahanaModel
        $wahanaModel = new WahanaModel();

        // Ambil data tiket yang memiliki stat = 1 dan tipe = 2(booth) dari database
        $data['wahanas'] = $wahanaModel->where('status', 1)
                               ->where('type', 2)
                               ->findAll();
---
SELECT *
FROM `wahana`
WHERE `status` = 1
AND `type` = 2