app/Controllers/GateController.php

    public function gatecek($gateId)
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            // User is not logged in, redirect to login page
            return redirect()->to('/');
        }

        // Get user data from session
        $data['name'] = session()->get('name');
        $data['username'] = session()->get('username');

        // Load model GateModel
        $gateModel = new GateModel();

        // Ambil data tiket yang memiliki stat = 1 dan tipe = 2(booth) dari database
        $gate = $gateModel->find($gateId);
---
SELECT *
FROM `gate`
WHERE `gate`.`id` = '3'

    public function cekgate()
    {
        // Ambil data POST dari form
        $rfidtiket = $this->request->getPost('rfidtiket');
        $gateId = $this->request->getPost('gateId');

        // Load BalanceModel dan WahanaModel
        $balanceModel = new BalanceModel();
        $wahanaModel = new WahanaModel();

        // Lakukan join antara BalanceModel dan WahanaModel berdasarkan kolom id pada BalanceModel dan wahana_id pada WahanaModel
        $result = $balanceModel->select('balance.*')
                            ->join('wahana', 'wahana.id = balance.wahana_id')
                            ->where('balance.tiket', $rfidtiket)
                            ->where('wahana.gate_id', $gateId)
                            ->first();

        if ($result) {
            $balanceId = $result['id']; // Ambil ID dari balance
            $amount = $result['amount'];

            // Jika data ditemukan, lanjutkan dengan operasi lainnya
            if ($amount > 1) {
                // Kurangi amount jika lebih dari 1
                $newAmount = $amount - 1;
                $balanceModel->update($balanceId, ['amount' => $newAmount]);
---
SELECT `balance`.*
FROM `balance`
JOIN `wahana` ON `wahana`.`id` = `balance`.`wahana_id`
WHERE `balance`.`tiket` = '123'
AND `wahana`.`gate_id` = '3'
 LIMIT 1
UPDATE `balance` SET `amount` = 1
WHERE `balance`.`id` IN ('24')