app/Controllers/LoketController.php

    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            // User is not logged in, redirect to login page
            return redirect()->to('/');
        }

        // Get user data from session
        $data['name'] = session()->get('name');
        $data['username'] = session()->get('username');

        // Load model WahanaModel
        $wahanaModel = new WahanaModel();

        // Ambil data tiket yang memiliki stat = 1 dari database
        $data['wahanas'] = $wahanaModel->where('status', 1)->findAll();
---
SELECT *
FROM `wahana`
WHERE `status` = 1

    public function submitTransaksi()
    {
        // Ambil data POST dari form
        $rfidtiket = $this->request->getPost('rfidtiket');
        $totalBayar = $this->request->getPost('totalBayar');
        $paymentType = $this->request->getPost('paymentType');
        $refno = $this->request->getPost('refno');
        $phone = $this->request->getPost('phone');
        $wahanas = $this->request->getPost('wahana'); // Ambil data array wahana

        // Validasi data (bisa tambahkan validasi tambahan sesuai kebutuhan)

        // Simpan data transaksi untuk setiap rfidtiket ke dalam tabel transaction menggunakan model
        $transactionModel = new TransactionModel();
        $transactionIdArray = []; // Array untuk menyimpan ID transaksi setiap rfidtiket

        foreach ($rfidtiket as $rfid) {
            $transactionData = [
                'tiket' => $rfid,
                'total' => $totalBayar,
                'payment_type' => $paymentType,
                'ref_number' => $refno,
                'phone' => $phone
            ];

            $transactionId = $transactionModel->insert($transactionData); // Simpan transaksi dan dapatkan ID transaksi
---
INSERT INTO `transaction` (`tiket`, `total`, `payment_type`, `ref_number`, `phone`, `created_at`, `updated_at`) VALUES ('123', '100000', 'Tunai', '123', '123', '2024-03-23 03:34:03', '2024-03-23 03:34:03')

                    ];
                }

                $savedSelected = $selectedTransactionModel->insertBatch($selectedTransactionData);
---
INSERT INTO `selected_transaction` (`amount`, `tiket`, `transaction_id`, `wahana_id`)
VALUES ('1','123',12,'1'), ('2','123',12,'11'), ('3','123',12,'9'), ('4','123',12,'7'), ('5','123',12,'17')