app/Controllers/SaldoController.php

    public function ceksaldo()
    {
        // Ambil data POST dari form
        $rfidtiket = $this->request->getPost('rfidtiket');

        // Load model yang diperlukan
        $balanceModel = new BalanceModel();
        $wahanaModel = new WahanaModel();

        // Lakukan query untuk menggabungkan data
        $saldoWahana = $balanceModel->select()
            ->join('wahana', 'balance.wahana_id = wahana.id')
            ->where('balance.tiket', $rfidtiket)
            ->findAll();
---
SELECT *
FROM `balance`
JOIN `wahana` ON `balance`.`wahana_id` = `wahana`.`id`
WHERE `balance`.`tiket` IS NULL

    public function gateValidation()
    {
        // Ambil idgate dan qrcode dari URL
        $idgate = $this->request->getVar('idgate');
        $qrcode = $this->request->getVar('qrcode');

        // Load model yang diperlukan
        $balanceModel = new BalanceModel();
        $wahanaModel = new WahanaModel();

        // // Lakukan query untuk menggabungkan data

        $saldoWahana = $balanceModel->select('balance.*')
            ->join('wahana', 'wahana.id = balance.wahana_id')
            ->where('balance.tiket', $qrcode)
            ->where('wahana.gate_id', $idgate)
            ->first();
---
SELECT *
FROM `balance`
JOIN `wahana` ON `balance`.`wahana_id` = `wahana`.`id`
WHERE `wahana`.`gate_id` = '1'
AND `balance`.`tiket` = '123'